index=win_evt event_id=4624
| where UserIsAdmin_decimal=1 AND UserName="Administrator" 
| eval admin=replace(UserIsAdmin_decimal, "1", "Yes")
| bucket _time span=1h
| stats count(LogonTime_decimal) AS "Logon Count" values(UserName) values(ComputerName) by _time 

(ParentBaseFileName="cmd.exe" OR ParentBaseFileName="powershell.exe") AND FileName="psexec.exe" AND (CommandLine="*-accepteula*") AND CommandLine="*\\*" 
| rex field=CommandLine "(?<RemoteIPAddr>\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3})"
| bucket _time span=1h
| stats count(RemoteIPAddr) values(RemoteIPAddr) by _time

event_simpleName=ProcessRollup2 OR event_simpleName=ProcessBlocked FileName="powershell.exe" CommandLine="powershell.exe -w hidden -ep bypass -Enc*" OR CommandLine="*-w hidden -noni -nop -c \"iex(New-Object*" OR CommandLine="powershell.exe reg add * HKCU\\software\\microsoft\\windows\\currentversion\\run*" OR CommandLine=
    "*System.Net.WebClient).DownloadString(\"http*" OR CommandLine="*System.Net.WebClient).DownloadString('http*" OR CommandLine="*Process.Create(\"powershell.exe -nop -w hidden*" OR CommandLine="*.Run\"powershell.exe -nop -w hidden -c \"\"IEX *" OR CommandLine="*.Run \"powershell.exe -nop -w hidden -e *" OR CommandLine="*FileExists(path + \"\\..\\powershell.exe\")*" OR CommandLine="*window.moveTo -4000, -4000*" OR CommandLine="*.CreateObject(\"WScript.Shell\")*" OR CommandLine="powershell.exe -ExecutionPolicy Bypass [System.Convert]::FromBase64String(*" 
| rex field=CommandLine "(?<DownloadURL>(www|http:|https:)+[^\s]+[\w])"
| stats count by DownloadURL 
